# 2.1 인덱스 구조 및 탐색
- 인덱스 탐색 과정이 수직적 탐색과 수평적 탐색 단계로 이루어진다.
## 2.1.1 미리 보는 인덱스 튜닝
- 온라인 트랜잭션 처리(Online Transaction Processing, OLTP) 시스템에서는 소량 데이터를 주로 검색해서 인덱스 튜닝이 중요하다.
- 인덱스 스캔 효율화 튜닝
    - 인덱스 스캔 과정에서 발생하는 비효율을 줄이는 것
        - 학생명부에서 시력이 1.0 ~ 1.5인 홍길동 학생 찾기의 예
            - 학생명부를 이름과 시력 순으로 정렬하는 것이 효율적
- 랜덤 액세스 최소화 튜닝
    - 테이블 액세스 횟수를 줄이는 것
    - 인덱스 스캔 후 테이블 레코드를 액세스할 때 랜덤 I/O를 방식 사용
    - 인덱스 스캔 효율화 튜닝보다 더 성능에 미치는 영향이 커서 중요하다.
    - SQL 튜닝은 랜덤 I/O와의 전쟁이다.
        - DB 성능이 느린 이유가 디스크 I/O 때문
            - 읽어야 할 데이터량이 많아서 디스크 I/O가 많이 발생
## 2.1.2 인덱스 구조
- 범위 스캔
    - 인덱스가 정렬돼 있기 때문에 테이블을 처음부터 끝까지 읽지 않고 일부만 읽고 멈출 수 있다.
- DBMS는 일반적으로 B*Tree 인덱스를 사용한다.
    - 나무를 거꾸로 뒤집은 모양
        - 뿌리(Root)가 위에 있고 가지(Branch)를 거쳐 잎사귀(Leaf)가 있다.
    - 루트와 브랜치 블록에 있는 각 레코드는 하위 블록에 대한 주소값을 가진다.
    - 키값은 하위 블록에 저장된 키값의 범위를 나타낸다.
    - 리프 블록에 저장된 각 레코드
        - 키값 순으로 정렬돼 있다.
        - 테이블 레코드를 가리키는 주소값인 ROWID가 있다.
            - 인덱스 키값이 같으면 ROWID 순으로 정렬된다.
            - ROWID = 테이블 블록 주소 + 로우 번호
            - 테이블 블록 주소 = 데이터 파일 번호 + 블록 번호
            - 블록 번호 : 데이터 파일 내에서 부여한 상대적 순번
            - 로우 번호 : 블록 내 순번
## 2.1.3 인덱스 수직적 탐색
- 정렬된 인덱스 레코드 중 `조건을 만족하는 첫 번째 레코드를 찾는 과정`
    - 인덱스 스캔 시작지점을 찾는 과정
- 루트 블록에서부터 시작
- 수직적 탐색 과정에 찾고자 하는 값보다 크거나 같은 값을 만나면, 바로 직전 레코드가 가리키는 하위 블록으로 이동한다.
## 2.1.4 인덱스 수평적 탐색
- 수직적 탐색을 통해 스캔 시작점을 찾은 후 찾고자 하는 데이터가 더 안 나타날 때까지 인덱스 리프 블록을 수평적으로 스캔한다.
- 인덱스에서 본격적으로 `데이터를 찾는 과정`
- 인덱스 리프 블록
    - 서로 앞뒤 블록에 대한 주소값을 가지는 `양방향 연결 리스트 구조`이기 때문에 수평적 탐색이 가능
- 인덱스 수평적 탐색의 이유
    - 조건절을 만족하는 데이터를 모두 찾기 위해서
    - ROWID를 얻기 위해서
        - 필요한 컬럼을 인덱스가 모두 가지고 있어서 인덱스만 스캔하고 끝날 수도 있지만 일반적으로 인덱스를 스캔하고서 테이블도 액세스하기 때문에 ROWID가 필요하다.
## 2.1.5 결합 인덱스 구조와 탐색
- 두 개 이상 컬럼을 결합해서 인덱스를 만들 수 있다.
- 인덱스 선두 컬럼을 모두 `=` 조건으로 검색할 때는 어느 컬럼을 인덱스 앞쪽에 두든 블록 I/O 개수가 같아서 성능도 똑같다.
- 선택도가 낮은 컬럼을 앞쪽에 두고 결합인덱스를 생성해야 검사 횟수를 줄여 성능에 유리하다는 건 엑셀처럼 평면 구조일 경우일 때 해당한다.
    - 결합 인덱스 생성 시 컬럼 배치 순서 예
    ```SQL
        select
            이름, 성별
        from
            사원
        where 
            성별 = '여자'
            and
            이름 = '유관순'
    ```
    - 인덱스를 `성별 + 이름` 순으로 구성한 경우
        - 총 사원 50명 중 성별 = '여자'인 레코드 25건을 찾는다.
        - 25건 중 이름을 검사해 2명 출력
            - 25번의 검사
    - 인덱스를 `이름 + 성별` 순으로 구성한 경우
        - 총 사원 50명 중 이름 = '유관순'인 레코드 2건을 찾는다.
        - 2건 중 성별을 검사해 2명 출력
            - 2번의 검사